w10_rake_bundler/bundler/readme.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="jp" xml:lang="jp">
<head>
<!-- 2024-11-23 Sat 12:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>bundler memo</title>
<meta name="author" content="Shigeto R. Nishitani" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/search.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">bundler memo</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org2af8e1e">1. install</a></li>
<li><a href="#orge7e44fb">2. revise</a></li>
<li><a href="#org864d5e1">3. run local</a></li>
</ul>
</div>
</div>

<div id="outline-container-org2af8e1e" class="outline-2">
<h2 id="org2af8e1e"><span class="section-number-2">1.</span> install</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-shell">&gt; sudo gem install bundler
&gt; bundle gem hello_rudy -b --git --mit --test=test-unit
</pre>
</div>
</div>
</div>

<div id="outline-container-orge7e44fb" class="outline-2">
<h2 id="orge7e44fb"><span class="section-number-2">2.</span> revise</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-shell">&gt; chmod a+x exe/hello_rudy
&gt; emacs hello_rudy.gemspec
</pre>
</div>
<p>
で怒られたところを修正します．
用意できてないところは，コメントアウトしときましょう．
</p>

<p>
さらにlib/hello_rudy.rbを次のように加筆します．
</p>

<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #cd6600;">require</span> <span style="color: #8b7355;">"hello_rudy/version"</span>

<span style="color: #1c86ee;">module</span> <span style="color: #00688b;">HelloRudy</span>
  <span style="color: #1c86ee;">class</span> <span style="color: #00688b;">Error</span> &lt; <span style="color: #00688b;">StandardError</span>; <span style="color: #1c86ee;">end</span>
  <span style="color: #7f7f7f;"># </span><span style="color: #7f7f7f;">Your code goes here...</span>
  name = <span style="color: #00688b;">ARGV</span>[0] || <span style="color: #8b7355;">'Rudy'</span>
  <span style="color: #cd6600;">puts</span> <span style="color: #8b7355;">"Hello </span><span style="color: #2e8b57;">#{name}</span><span style="color: #8b7355;">."</span>
<span style="color: #1c86ee;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org864d5e1" class="outline-2">
<h2 id="org864d5e1"><span class="section-number-2">3.</span> run local</h2>
<div class="outline-text-2" id="text-3">
<p>
そうして，動くことが確認できたら，
</p>
<pre class="example" id="org0b29d97">
&gt; bundle exec exe/hello_rudy
&gt; sudo rake install:local
hello_rudy 0.1.0 built to pkg/hello_rudy-0.1.0.gem.
hello_rudy (0.1.0) installed.
</pre>

<p>
そうすると
</p>
<pre class="example" id="orge2438dd">
&gt; hello_rudy Rudy
Hello Rudy.
</pre>
<p>
とちゃんと動くようになったでしょ？
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Shigeto R. Nishitani</p>
<p class="date">Created: 2024-11-23 Sat 12:53</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
